Merge pull request #3 from yu-iskw/alpha
Implement alpha version
